package tnt4;

public class Main {
	public static void main(String[] args) {
		new App().start();
	}
}

// 출력 통일하기!!! 깔끔하게 - 자간 같은것도!!! - 지금 많이 더러움

// = 추가해야 하는 것 =
// - 새로운 QnA 생기면 표시 및 답변
// 유저 기능 - QnA 작성 기능

// 중간발표 피드백
// 2. 운동 루틴은 관리자가 직접 등록하는가? 사용자 개인의 운동 루틴을 공유하는 기능이 있으면 좋겠다.
// 3. 운동/식단 선택 페이지가 회원가입에 있으면 좋겠다. 어차피 사용자마다 다르게 입력되면 DB 회원 Table에 넣으면 좋겠다.
//    - 사용자 입장에서 매번 보고싶은 운동을 선택해야 하는 불필요 동작을 안할 수 있게 되니 더욱 좋은 서비스가 될 것

// 진행 중
// 공지사항 게시만/QnA게시판 추가 완료 - 관리자 /작성/수정/ 기능 추가해야 함
// 회원정보 수정 기능 - 탈퇴는 잘 되는데 수정한 정보가 DB에 저장이 안돼서 결과적으로 수정이 안됨