package tnt4;

public class Main {
	public static void main(String[] args) {
		new App().start();
	}
}
// = 추가해야 하는 것 =
// 공지사항 게시판 이동 및 공지사항 보여주기
// QnA 게시판 기능
// 관리자 기능 - 회원목록 조회/삭제, 운동/식단 목록 조회/삭제, 공지사항 게시판/QnA 게시판 조회 및 조회/작성/수정/삭제 기능
// 추천기능
// 식단 목록 수정

// 중간발표 피드백
// 1. 헬스장 마다 머신기구 사용이 다름 - 어떻게 보여 줄 건지?
// 2. 운동 루틴은 관리자가 직접 등록하는가? 사용자 개인의 운동 루틴을 공유하는 기능이 있으면 좋겠다.
// 3. 운동/식단 선택 페이지가 회원가입에 있으면 좋겠다. 어차피 사용자마다 다르게 입력되면 DB 회원 Table에 넣으면 좋겠다.
//    - 사용자 입장에서 매번 보고싶은 운동을 선택해야 하는 불필요 동작을 안할 수 있게 되니 더욱 좋은 서비스가 될 것

// 완성 목록
// 완료 - 회원탈퇴 기능
// 완료 - 운동/식단 명령어가 왜 article select인지? 명령어 이름과 수행이 일치하지 않는 듯한 느낌